Project/Toir.Adaptation/src/Enums/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СтатусыДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e3824168-331e-4e9c-9a97-88d442450c1c">
    <name>гкс_ВыполненНеобходимАктПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b486cddf-c606-48a0-b4d9-79359f8995b4">
    <name>Устраняется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="12013120-ddb7-448d-8a52-b1a0212dd9c4">
    <name>Выполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="17242492-094d-4d6f-805a-a10d65fa8670">
    <name>Зарегистрирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="62ccdc8a-74d4-48f3-bfc6-e3928a0ae7cb">
    <name>ВозобновленоПослеОтказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e4ffdb13-bdf4-4105-92f1-9c5dc748637d">
    <name>Выполняется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="91bc17f5-8b7c-487f-8759-3e891929fcc6">
    <name>ОтказИсполнителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="97ff8156-77b5-45f9-93d6-665a3335a2bf">
    <name>ОтказПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ee12e5d3-3edb-491c-8af6-c4cb0fc16d16">
    <name>гкс_Новый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЗавершитьРемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f78c6d7a-513d-4172-acd6-67cd539553be">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6ebc082-5b34-4dc9-989e-5ceca388a781">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="93edf17a-e6e1-43b7-b637-bb7683198138">
    <name>РемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c026f7f3-9001-48e8-ae43-b6311afc572a">
      <name>Родитель_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="13c5222c-e72c-4deb-976b-ea5e71c2a76c">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5b155dad-268f-40a5-9cda-adf38b849861">
      <name>РемонтнаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="292545f4-3656-4274-98e7-6524e7005040">
      <name>НоваяОперация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1e00ed1-d007-48a1-a97c-9c09cb1af366">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bce66135-2c2d-4b02-9b24-1b4b257fc415">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="6e222db4-48e2-41e6-b0db-be541d07402b">
    <name>МатериальныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="783b72be-3d92-47e1-83c1-f83e5d116bfb">
      <name>гкс_Давальческие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="305c47b2-824e-4796-a135-d4962b2f23d3">
    <name>ИсполнителиПоРемонтам</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b23ddd04-6d70-49d8-a27c-cf8169874579">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37d6bc6d-0833-419f-b341-b8dea598faf1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4c3bfad-e541-47e8-9005-fa8a9857cba5">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a4a678fd-1266-4080-b919-06a2d79fae8a">
    <name>гкс_РежимРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe14a8d2-1944-4f1e-b299-7a9b0223ef28">
    <name>гкс_ОсобыеУсловия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41e7789d-5d85-460d-be8f-8fc2b293bbbd">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>МестоПроведенияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОпаснаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5e090819-3bf8-4a64-a7d2-0ab585ce4316">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="449da75b-fa30-4096-8fb8-e00acceca535">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d01a746a-1f60-452d-b092-1ead64a66198">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="6a0ca5c1-fbd3-4c7e-bdde-3fb81c617b0a">
    <name>Исполнители</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c1ae9921-70cf-481b-885a-5b0ab42e254a">
      <name>гкс_ВремяРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>11</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0701d7e4-cb55-4f74-aab5-bcfc142200b6">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aa8b8405-de2a-40f9-abcf-463c138ba33a">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="64107450-ce42-48a3-b3d7-cdbfefb4f781">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="98f1156a-550e-4650-b792-f2b9616909e1">
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8aaffcc0-63ff-47b9-a8dd-73e848c02a69">
    <name>ИсполнителиПоРемонтам</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="189fe98f-02ff-434b-8b7f-6878c66dd57f">
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d0f7b50e-67c4-42a9-bec6-d0b463a7e599">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="45c58294-ca52-48e5-8e27-dc256cfa6f69">
    <name>Ответственные</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="81d9731d-7525-44cf-a76c-86ef23d1326c">
      <name>ОтветственноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aea61b3d-2bc1-41bd-8f3b-9930526732fe">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="84523221-6fd9-44b8-844b-b7c13eb9186f">
    <name>РемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a0d60cce-1bb8-48f6-90eb-d8a28e097c3e">
      <name>гкс_Огневая</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be7d6060-9f1e-428b-9ff8-f010677244f7">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="db8f9a67-aa24-4337-913e-55cf61e11ff6">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d4d1ad7a-8eb6-4821-b1b8-09da6816b24e">
      <name>РемонтнаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7cd36bfa-c12e-4642-be55-83b9067704c7">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_АктПриемкиОборудования/торо_АктПриемкиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктПриемкиОборудования</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8513385e-6034-419a-b807-16cbaf009992">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="80123eff-0995-47d5-8851-cacdb4ed1cc9">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/CommonModules/торо_РаботаСоСтатусамиДокументовСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПроверитьВозможностьИзмененияСтатусаДефекта(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонт.Ссылка КАК Заявка,
		|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка КАК Акт
		|ПОМЕСТИТЬ ЗаявкаСФлагом
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
		|		ПО (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка = &Ссылка)
		|			И торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
		|			И (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""ДА"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонт.Ссылка,
		|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
		|			ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""ДА"")
		|				И торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
		|		ПО (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка = &Ссылка)
		|			И торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаСФлагом.Заявка КАК Заявка,
		|	ЗаявкаСФлагом.Акт КАК Акт,
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено:{
		|	торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование КАК Дефект
		//|	торо_ВыявленныеДефекты.Ссылка КАК Дефект 
		// } Гкс-[TOIR20-558] Вялых Д.А. от 05.03.2025.
		|ПОМЕСТИТЬ ВсяЦепочка
		|ИЗ
		|	ЗаявкаСФлагом КАК ЗаявкаСФлагом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено:{
		//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
		//|			ПО торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование = торо_ВыявленныеДефекты.Ссылка
		// } Гкс-[TOIR20-558] Вялых Д.А. от 05.03.2025.
		|		ПО ЗаявкаСФлагом.Заявка = торо_ЗаявкаНаРемонтДокументыОснования.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(торо_АктПриемкиОборудованияДокументыОснования.Ссылка.Проведен, ЛОЖЬ)) КАК АктПроведен
		|ИЗ
		|	ВсяЦепочка КАК ВсяЦепочка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктПриемкиОборудования.ДокументыОснования КАК торо_АктПриемкиОборудованияДокументыОснования
		|		ПО (ВсяЦепочка.Заявка = торо_АктПриемкиОборудованияДокументыОснования.ДокументОснование
		|				ИЛИ ВсяЦепочка.Акт = торо_АктПриемкиОборудованияДокументыОснования.ДокументОснование
		|				ИЛИ ВсяЦепочка.Дефект = торо_АктПриемкиОборудованияДокументыОснования.ДокументОснование)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() И Выборка.АктПроведен = Ложь Тогда 
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции 

&ИзменениеИКонтроль("ПолучитьТаблицуУстанавливаемыхСтатусовПоСсылке")
Функция Расш_гкс_ПолучитьТаблицуУстанавливаемыхСтатусовПоСсылке(Регистратор, ДокументыОснования)

	ТипДокументаСтрока = ПолучитьТипДокументаКакСтроку(Регистратор);
	
	#Удаление
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
		ИЛИ ТипЗнч(Регистратор) = ТИП("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
	#КонецУдаления
	#Вставка
	НужноПодменитьСтатус = Ложь;
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда 
		Если ПроверитьВозможностьИзмененияСтатусаДефекта(Регистратор) Тогда 
			ЗавершитьРемонтныеРаботы = Регистратор.ЗавершитьРемонтныеРаботы;
		Иначе
			ЗавершитьРемонтныеРаботы = Ложь;
			НужноПодменитьСтатус = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = ТИП("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
	#КонецВставки
		ЗавершитьРемонтныеРаботы = Регистратор.ЗавершитьРемонтныеРаботы;
	Иначе
		ЗавершитьРемонтныеРаботы = Ложь;
	КонецЕсли;

	ТаблицаУстанавливаемыхСтатусов = торо_РаботаСоСтатусамиДокументовПовтИсп.ПолучитьТаблицуУстанавливаемыхСтатусов(ТипДокументаСтрока, ДокументыОснования, ЗавершитьРемонтныеРаботы);
	#Вставка
	// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Закоментировано:{
	//Если НужноПодменитьСтатус = Истина Тогда 
		//Для Каждого СтрокаТаблицы Из ТаблицаУстанавливаемыхСтатусов Цикл
		//	Если (СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется
		//		И СтрокаТаблицы.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка())
		//		Тогда 
		//		СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.гкс_ВыполненНеобходимАктПриемки;
		//	ИначеЕсли (СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполняется
		//		И СтрокаТаблицы.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка() И СтрокаТаблицы.Порядок = 2) Тогда 
		//		СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
		//		СтрокаТаблицы.Порядок = 3;
		//	ИначеЕсли (СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполняется
		//		И СтрокаТаблицы.ТипДокумента = Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка()
		//		И СтрокаТаблицы.Порядок = 1) Тогда 
		//		СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
		//		СтрокаТаблицы.Порядок = 2;
		//	ИначеЕсли (СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется
		//		И СтрокаТаблицы.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка()
		//		И СтрокаТаблицы.Порядок = 2) Тогда 
		//		СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устранен;
		//		СтрокаТаблицы.Порядок = 3;
		//	КонецЕсли;
		//КонецЦикла;
	//КонецЕсли;
	// } Гкс-[TOIR20-558] Вялых Д.А. от 05.03.2025.
	#КонецВставки

	Возврат ТаблицаУстанавливаемыхСтатусов;

КонецФункции

&ИзменениеИКонтроль("УстановитьВручнуюСтатусДляРемонтаВЗаявке")
Функция Расш_гкс_УстановитьВручнуюСтатусДляРемонтаВЗаявке(Знач ЗаявкаСсылка, Знач ИДРемонта, Знач Статус, Знач ВремяУстановки, Знач КомментарийКСтатусу, Знач Пользователь, ПерезаписыватьСтандартныеСтатусы, Регистратор)

	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;

	Если Не ТипЗнч(ИДРемонта) = Тип("Массив") Тогда
		МассивИДРемонта = Новый Массив(1);
		МассивИДРемонта[0] = ИДРемонта;
	Иначе
		МассивИДРемонта = ИДРемонта;
	КонецЕсли;

	Если ВремяУстановки = Неопределено Тогда
		ВремяУстановки = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаСсылка, "Дата");

	МассивРезультатовПоРемонтам = Новый Массив;
	НачатьТранзакцию();

	Блокировки = Новый БлокировкаДанных;

	Блк = Блокировки.Добавить("РегистрСведений.торо_СтатусыРемонтовВЗаявках");
	Блк.Режим = РежимБлокировкиДанных.Исключительный;
	Блк.УстановитьЗначение("ЗаявкаНаРемонт", ЗаявкаСсылка);

	Блокировки.Заблокировать();

	ТекДанныеСтатусов = ТекДанныеСтатусовРемонтовЗаявки(ЗаявкаСсылка);

	флЗаписывать = Ложь;

	НЗСтатусыВЗаявках = РегистрыСведений.торо_СтатусыРемонтовВЗаявках.СоздатьНаборЗаписей();
	НЗСтатусыВЗаявках.Отбор.ЗаявкаНаРемонт.Установить(ЗаявкаСсылка);
	НЗСтатусыВЗаявках.Прочитать();

	сзУдаляемыеЗаписи = Новый СписокЗначений;
	Для Каждого Запись Из НЗСтатусыВЗаявках Цикл
		Если Запись.ДокументИсточник = Регистратор Тогда
			сзУдаляемыеЗаписи.Добавить(Запись);
		КонецЕсли; 
	КонецЦикла;

	Для каждого ЭлтСз Из сзУдаляемыеЗаписи Цикл
		НЗСтатусыВЗаявках.Удалить(ЭлтСз.Значение);
	КонецЦикла;

	Для Каждого ИДРемонта Из МассивИДРемонта Цикл
		РезультатОбработкиРемонта = Новый Структура("ИДРемонта, Успешно, СтатусУстановлен, ОписаниеРезультатаТекст",ИДРемонта, Истина, Ложь, "");
		ПоменятьСтатусНаВыполнен = РемонтЗавершен(ИДРемонта, Регистратор);

		УстанавливаемыйСтатус = Статус;
		Если ПоменятьСтатусНаВыполнен Тогда
			УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
		КонецЕсли;

		РезультатПроверки = МожноУстановитьСтатусДляРемонтаВЗаявке(ТекДанныеСтатусов, ИДРемонта, УстанавливаемыйСтатус, Регистратор);
		Если РезультатПроверки.Возможно Тогда

			флЗаписывать = Истина;
               
			Запись = НЗСтатусыВЗаявках.Добавить();

			Запись.ЗаявкаНаРемонт = ЗаявкаСсылка;
			Запись.ИДРемонта = ИДРемонта;
			Запись.Период = ВремяУстановки;
			Запись.Статус = УстанавливаемыйСтатус;
			Запись.КомментарийКСтатусу = КомментарийКСтатусу;
			Запись.Пользователь = Пользователь;
			Запись.ДокументИсточник = Регистратор;

			РезультатОбработкиРемонта.СтатусУстановлен = Истина;

		Иначе
			// Формируем описание причины, почему не был установлен статус, в некоторых случаям устанавливаем Успешно в Ложь
			Если РезультатПроверки.Причина = "УжеУстановлен" Тогда
				#Удаление
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("ru = 'Статус %1 уже установлен!'"), УстанавливаемыйСтатус);
				#КонецУдаления
				#Вставка
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("es='¡El estatus %1 es establecido ya!';ru='Статус %1 уже установлен!';en='Status %1 already set!'"), УстанавливаемыйСтатус);
				#КонецВставки
			ИначеЕсли РезультатПроверки.Причина = "СтатусЗаявкиНеУстановлен" Тогда
				РезультатОбработкиРемонта.Успешно = Ложь;
				#Удаление
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("ru = 'Для заявки не установлен никакой статус, заявка не проведена!'");
				#КонецУдаления
				#Вставка
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("es='¡Para la demanda no es establecido ningún estatus, la demanda no es pasada!';ru='Для заявки не установлен никакой статус, заявка не проведена!';en='No status has been set for the application, no application has been submitted!'");
				#КонецВставки
			ИначеЕсли РезультатПроверки.Причина = "РемонтОтсутствуетВЗаявке" Тогда
				РезультатОбработкиРемонта.Успешно = Ложь;
				#Удаление
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("ru = 'Ремонт отсутствует в заявке!'");
				#КонецУдаления
				#Вставка
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("es='¡La reparación falta en la demanda!';ru='Ремонт отсутствует в заявке!';en='Repair is not in the application!'");
				#КонецВставки
			ИначеЕсли РезультатПроверки.Причина = "УстановленБолееПриоритетный" Тогда
				#Удаление
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("ru = 'Более приоритетный статус %1 уже установлен!'"), РезультатПроверки.ТекСтатусРемонта);
				#КонецУдаления
				#Вставка
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("es='¡Un estatus más de prioridad %1 es establecido ya!';ru='Более приоритетный статус %1 уже установлен!';en='The priority status%1 is already set!'"), РезультатПроверки.ТекСтатусРемонта);
				#КонецВставки
			Иначе
				РезультатОбработкиРемонта.Успешно = Ложь;
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = РезультатПроверки.Причина;
			КонецЕсли;

		КонецЕсли;
		МассивРезультатовПоРемонтам.Добавить(РезультатОбработкиРемонта);
	КонецЦикла;

	Если флЗаписывать Тогда
		НЗСтатусыВЗаявках.Записать();
	КонецЕсли;
	ЗафиксироватьТранзакцию();

	Возврат МассивРезультатовПоРемонтам;

КонецФункции

&Вместо("УстановитьСтатусДокумента")
Процедура Расш_гкс_УстановитьСтатусДокумента(Ссылка, Регистратор, Движения, Статус, СтатусУстановлен)
	НовыйСтатусУстановлен = СтатусУстановлен;
	Если Статус = Перечисления.торо_СтатусыДокументов.гкс_ВыполненНеобходимАктПриемки Тогда 
		НовыйСтатусУстановлен = Истина;
	КонецЕсли;
	ПродолжитьВызов(Ссылка, Регистратор, Движения, Статус, НовыйСтатусУстановлен);
КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьТекстЗапросаСрезаПоследнихПоРегистру")
Функция гкс_ПолучитьТекстЗапросаСрезаПоследнихПоРегистру(ИмяРегистра, ПоДокументу, ОбъединитьСОснованиями, КромеРегистратора, ПоРегистратору, ИмяВременнойТаблицы, ОбъединитьВсе)

	Если ОбъединитьСОснованиями Тогда
		ВыбираемыеПоля = "	торо_СтатусыДокументовСрезПоследних.ИзменяемыйДокумент,
		|	торо_СтатусыДокументовСрезПоследних.СтатусДокумента";

	Иначе
		ВыбираемыеПоля = "	торо_СтатусыДокументовСрезПоследних.Период,
		|	торо_СтатусыДокументовСрезПоследних.Регистратор,
		|	торо_СтатусыДокументовСрезПоследних.НомерСтроки,
		|	торо_СтатусыДокументовСрезПоследних.Активность,
		|	торо_СтатусыДокументовСрезПоследних.ИзменяемыйДокумент,
		|	торо_СтатусыДокументовСрезПоследних.СтатусДокумента,
		|	торо_СтатусыДокументовСрезПоследних.СтатусУстановлен";
	КонецЕсли;

	ТекстЗапроса = "ВЫБРАТЬ " + ВыбираемыеПоля + 
	" %ИспользоватьВременнуюТаблицу%
	|ИЗ
	|	РегистрСведений." + ИмяРегистра + ".СрезПоследних(
	|			,
	|			СтатусУстановлен = ИСТИНА %Условие1% %Условие2% %Условие3%) КАК торо_СтатусыДокументовСрезПоследних";

	ЕстьПредыдущееУсловие = Ложь;

	Если ПоДокументу Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие1%"," И ИзменяемыйДокумент = &Документ ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие1%"," ");
	КонецЕсли;

	Если КромеРегистратора Тогда 
		#Удаление 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," И Регистратор <> &Регистратор ");
		#КонецУдаления
		#Вставка 
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено:{
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," И Регистратор В
		|	(ВЫБРАТЬ
		|		ДокументыОснования.ДокументОснование
		|	ИЗ
		|		ДокументыОснования КАК ДокументыОснования) ");
		// } Гкс-[TOIR20-558] Вялых Д.А. от 05.03.2025.
		#КонецВставки
	ИначеЕсли ПоРегистратору Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," И Регистратор = &Регистратор ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," ");
	КонецЕсли;

	Если ОбъединитьСОснованиями Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие3%"," И ИзменяемыйДокумент В
		|(ВЫБРАТЬ
		|	ДокументыОснования.ДокументОснование
		|ИЗ
		|	ДокументыОснования" + ИмяРегистра + " КАК ДокументыОснования) ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие3%"," ");
	КонецЕсли;

	Если ИмяВременнойТаблицы = "" Тогда
		Если ОбъединитьВсе Тогда
			ТекстЗапроса = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "");
		КонецЕсли;
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

// Процедура - Добавить статус в заголовок формы
//
// Параметры:
//  Заголовок - Строка - Заголовок формы.
//  Ссылка - УправляемаяФорма - Форма которой в заголовок следует добавить статус документа.
//
// Возвращаемое значение:
//  Строка - заголовок формы.
Функция гкс_ДобавитьСтатусВЗаголовокФормы(Заголовок, Ссылка) Экспорт
	// Гкс+[TOIR20-608] Вялых Д.А. от 21.07.2025. Добавлено:{	
	ТекущийСтатусДокумента = ПолучитьТекущийСтатусДокумента(Ссылка);
	
	Если ТекущийСтатусДокумента <> Неопределено Тогда
		Возврат Заголовок + " [" + Строка(ТекущийСтатусДокумента) + "]";
	Иначе
		Возврат Заголовок;
	КонецЕсли;
	// } Гкс-[TOIR20-558] Вялых Д.А. от 21.07.2025.		
КонецФункции

#КонецОбласти
